roles_name = {
    0: "Исполнитель",
    1: "Предстедатель/Координатор",
    2: "Формирователь",
    3: "Мыслитель/Генератор идей",
    4: "Разведчик(Исследователь ресурсов)",
    5: "Оценщик",
    6: "Коллективист",
    7: "Доводчик(Завершающий работу)"
}

description_roles = {
    0: """Это член команды, выражающий ее сущность, потому что цели Исполнителя идентичны
целям команды. Часто Исполнитель является именно тем руководителем, выполняющим
задания, которые другие не всегда хотят выполнять. Исполнитель систематически составляет планы и эффективно претворяет их в производство. Стиль Исполнителя в команде
- организация работ. Он может иметь недостаток гибкости и не любит непроверенные идеи.
""",
    1: """Этот тип руководителя организует работу команды и использование ресурсов в
соответствии с групповыми целями. Председатель имеет ясное представление о сильных и
слабых сторонах команды и работает с максимальным использованием потенциала каждого
члена команды. Председатель может не обладать блестящим интеллектом, но он хорошо
руководит людьми. Главная личная черта характера Председателя - это сильное
доминирование и преданность групповым целям. Председатель является спокойным,
несуетливым, самодисциплинированным, поощряющим и поддерживающим типом
руководителя команды. Стиль руководства командой Председателя - принимать вносимые
вклады в деятельность команды и оценивать их в соответствии с целями команды. """,
    2: """Это другой, более умело управляющий, честолюбивый, оппортунистический,
предпринимательский тип руководителя команды. Он формирует усилия команды через
установление целей и приоритетов. Формирователь присоединяется к точке зрения, что
победителей не судят. Стиль руководства Формирователя - оспаривать, мотивировать,
достигать. Он склонен к провокациям, раздражению и нетерпению.
""",
    3: """Это интровертный (сосредоточенный на своем внутреннем мире), умный, склонный к
нововведениям член команды. Мыслитель представляет новые идеи, пытается их
развивать, разрабатывает стратегию. Он интересуется, в основном, более широкими
вопросами, которые могут дать результат, при недостаточном внимании к деталям. Стиль
Мыслителя - привносить инновационные идеи в работу команды и ее цели. Он склонен
"витать в облаках" и игнорировать детали или протокол.
""",
    4: """Это экстравертивный (ориентированный на внешний мир), собирающий ресурсы тип
генератора идей. Разведчик исследует и докладывает об идеях, ресурсах и новых
усовершенствованиях, которые имеются вне команды. Он естествен в общественных
отношениях и создает полезные внешние контакты для команды. Он обычно знает, как
примирить интересы людей с общественными интересами. Разведчик обычно знает, кто
может помочь решить проблемы. Стиль Исследователя ресурсов - создать сеть и собирать
полезные ресурсы для команды. Разведчики могут терять интерес, стоит только пройти
первоначальному увлечению.
""",
    5: """Оценщик объективен при анализировании проблем и оценке идей. Редко охваченный
энтузиазмом, он защищает команду от принятия импульсивных, отчаянных решений. Стиль
построения команды Оценщика - объективно анализировать и оценивать идеи и решения
команды. Им может не хватать вдохновения или способности мотивировать других.""",
    6: """Коллективист играет ориентированную на отношения, поддерживающую
роль. Этот чрезвычайно популярный тип нередок среди высших менеджеров. Коллективист
благоприятно действует на дух команды, улучшает межличностное общение, сводит к
минимуму конфликты в команде. Стиль построения команды Коллективиста - поддерживать
отношения внутри команды. Он может быть нерешителен в момент кризиса.""",
    7: """Доводчик продвигается вперед и настаивает на данном плане, проекте или предложении, когда
возбуждение и энтузиазм других членов команды исчерпаны. Доводчик хорошо планирует,
выполняет и доводит до конца задачи команды. Он раздражается, если работа команды отстает от
графика, и теряет удовлетворение от работы, когда работа не завершена. Стиль построения команды
Доводчика - настаивать ради продвижения вперед, выдерживать сроки."""
}